Revit 2027 API
TextElement.GetMaximumAllowedWidth Method
Overload List
Name | Description
GetMaximumAllowedWidth() |  Returns the maximum width the text element can be assigned.
GetMaximumAllowedWidth(Document, ElementId) |  Returns the maximum width the text element can be created with.
Top
See Also
Reference
TextElement Class
Autodesk.Revit.DB Namespace